# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

from sys import argv

def salary():
    name, working_out, rate, bonus = argv
    print(f'Salary: {int(working_out) * int(rate) + int(bonus)}')

salary()
